Revit 2026 API

# RebarCreateFreeForm(Document, RebarBarType, Element, IListCurveLoop, RebarFreeFormValidationResult) Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.CreateFreeForm(Document doc, RebarBarType barType, Element host, IList(CurveLoop) curves, RebarStyle style) instead.")]
public static Rebar CreateFreeForm(
	Document doc,
	RebarBarType barType,
	Element host,
	IList<CurveLoop> curves,
	out RebarFreeFormValidationResult error
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.CreateFreeForm(Document doc, RebarBarType barType, Element host, IList(CurveLoop) curves, RebarStyle style) instead.")>
Public Shared Function CreateFreeForm (
	doc As Document,
	barType As RebarBarType,
	host As Element,
	curves As IList(Of CurveLoop),
	<OutAttribute> ByRef error As RebarFreeFormValidationResult
) As Rebar
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.CreateFreeForm(Document doc, RebarBarType barType, Element host, IList(CurveLoop) curves, RebarStyle style) instead.")]
static Rebar^ CreateFreeForm(
	Document^ doc,
	RebarBarType^ barType,
	Element^ host,
	IList<CurveLoop^>^ curves,
	[OutAttribute] RebarFreeFormValidationResult% error
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.CreateFreeForm(Document doc, RebarBarType barType, Element host, IList(CurveLoop) curves, RebarStyle style) instead.")>]
static member CreateFreeForm :
        doc : Document *
        barType : RebarBarType *
        host : Element *
        curves : IList<CurveLoop> *
        error : RebarFreeFormValidationResult byref -> Rebar
```

#### Parameters

doc Document

barType RebarBarType

host Element

curves IListCurveLoop

error RebarFreeFormValidationResult

#### Return Value

Rebar

#### Reference

Rebar Class

CreateFreeForm Overload

Autodesk.Revit.DB.Structure Namespace